

Router 의 역할 
	: L3 장비
	: 서로 다른 Network 를 연결하고 Broadcast Domain 을 나눈다
	: 기능
		1. 라우팅
			: 수신한 packet 의 목적지 IP 주소를 보고 packet 을 전송할 최적의 경로 설정
				: 최적의 경로 결정 방법
					(1) 다이나믹 라우팅 방식 >> 자동적으로 경로 설정
						sol1 >> Distance Vector - 홉카운트만을 가지고 최적 경로를 연산
							: 홉카운트 >> 경유하는 라우터의 개수
							: 주로 소규모 네트워크에서 사용
							: 비유 ) 역이 더 적어서 먼저 종착지에 도착할꺼다 
						sol2 >> Linkstate - 장치간의 속도 등 전반적인 정보를 종합해서 최적의 경로를 연산
							: 주로 대규모 네트워크 에서 사용
							: 비유) 지하철 속도가 더 빨라서 먼저 종착지에 도착할꺼다

					(2) 스태틱 라우팅 방식 >> 사람이 일일이 경로를 미리 설정해둠


		2. 스위칭 
			: 방향 전환 
			: 결정된 경로대로 패킷 전송

		3. NAT 기능
			: 사설 IP 를 공인 IP 로 바꿔준다


	: Routing table을 보고 packet을 전송하게 된다
		: routing table
			: 네트워크상의 특정 목적지까지의 거리와 가는 방법등을 명시하고 있는 테이블

	: 목적지까지 전송을 책임지지 않고 목적지 경로상의 다음 Router에게 packet 전달만을 한다.	
		: 그러니까 처음 부터 길을 다 알고 가는게 아니라 중간 중간에 물어보면서 길 찾는거다

	: 라우터 종류
		1. 단독형 >> 일체형으로 이미 모든 interface 가 구성되있음. 확장성x
			: 잘 안쓴다
		2. 모듈형 >> 사용자의 필요에 따라서 interface 모듈을 직접 꽂아서 사용 가능 . 확상성0

	: 라우터의 포트 종류
		: 내부 내트웍 인터페이스  >> 1:1 통신을 위한게 아니라 1:n 통신이니까 내부 내트웍과 연결하는 포트필요
			: ex>> (fast) Ethernet  포트
			: 그러니까 LAN 구간의 Interface 를 의미

		: 외부 내트웍 인터페이스 >> 외부로 나가기 위한 포트
			: WAN 구간의 interface 를 의미
			: ex) serial interface

		: 관리용 인터페이스 Console Port

	: 라우터에 사용되는 케이블 종류
		1) V.35  WAN 구간(Serial Interface)에 사용되는 케이블 중 하나
			: 그러니까 라우터와 외부 라우터를 연결하는 케이블
 		2) UTP  LAN 구간(Ethernet Interface)에 사용되는 케이블
			: 그러니까 라우터와 호스트들(컴퓨터들) 을 연결하는 케이블
 		3) Console cable : 장비 관리용 케이블
			: 암묵적으로 하늘색으로 약속됨


	: IOS Internetworking Operating System
		: 라우터에서 사용되는 소프트웨어
			: 라우터도 일종의 컴퓨터다
			: 그러니까 pc의 window 처럼 라우터의 운영체제인거다

	: 라우터의 내부 구성
		: 컴터랑 비슷한ㄴ
			: cpu,  ram , flash , power supply( 전원공급)  , rom , 팬 (열나니까) , interface , 
				: 특히 linkstate 같은 방식은 연산 많이 해야되서 cpu 중요
			: 라우터 작업은 모두 ram 위에서 동작

		: 종류
			(1) RAM Random Access Memory
				: 파일들이 올라와서 동작되는 장소
					: 그러니까 IOS 가 업로드되어 실행되고, routing table 과 구성 파일(=설정내용)이 올라와서 동작하는 장소
					: RAM에 올라가 있는 설정내용은 ‘Running-config’ 
				: 휘발성 메모리이기 때문에 전원 차단시 모든 정보가 지워짐

			(2) NVRAM Non Volatile RAM
				: 비휘발성 메모리
				: 설정파일이 저장되어있다( routing table 등은 저장하지 않는다)
					: NVRAM에 저장된 설정내용은 ‘Startup-config’

			(3) Flash 메모리
				: 주로 ios 이미지 파일이 저장됨
				: NVRAM 보다 메모리 용량이 크다 
				: 라우터에 새로운 기능이 추가되면 라우터 자체를 교환하는게 아니라 ios 를 업그레이드를 하면 된다.
				: 비휘발성


			(4) ROM Read Only Memory
				: 펌웨어 (=router 의 가장 기본적인 내용) 저장
					: 펌웨어 >> 하드웨어의 기본적인 작동,제어를 담당하는 소프트웨어.
				: 참고로 rom 은 솦웨어를 사용하는 모든 장치에 들어있음
				: Bootstrap 
					: 일종의 부팅 과정의 순서
						: 전원이 들어올 경우 어떤 순서로 router 자신의 상태를 점검하ㅏ고, ios 를 어디서 ram 으로 올리는지 등의 내영이 저장되있음
				: 특별한 경우가 아닌 이상 교체 잘 안함


	:  Router 부팅 과정 
 		0) 전원 킴
 		1) Power on self test (POST)
			: 자가진단
 		2) Load and run bootstrap code
			: 부팅 순서 정함
 		3) Find the IOS software
			: 운영체제 솦웨어 찾음
 		4) Load the IOS software
			: 운영체제 솦웨어 올림 . 그러니까 실행
 		5) Find the configuration
			: 설정파일 찾음
 		6) Load the configuration
			: 설정파일 로드 (다이나믹, 스태틱 뭐 이런거 정의되있는)
 		7) Run
			: 실행


	: 라우터 접속 방법
		1. Console cable
			: 절차
				1.라우터의 conolse 포트에 console cable 을 연결하고. 나머지 한쪽을 컴터의 serial 포트 에 연결
					: 그러니까 라우터 하나가 "장비용 pc"랑 "다른라우터" 랑연결되있는 형태인거다

				2. 연결 후 터미널 프로그램을 사용하여 접속
					: 터미널
						: 명령어를 치는 곳 >> 터미널 창
						: 명령어를 치면 번역해 주는 얘 >> 쉘
						: 하드웨어와 소프트 웨어를 연결해줌>> 커널
			: Router 에 pc 를 직접 연결해야하고, console cable 이 필요하다는 단점이 있다

		2. Telnet
			: Router 를 관리할떄 가장 많이 사용하는 방법
			: 라우터의 IP 주소를 알고, 논리적으로 통신이 가능한 상태면(=인터넷 되면) 장소와 상관 없이 접속해서 관리 가능하게 해주는거
				: 초기 설치 시 혹은 논리적 통신이 불가한 상태면 telnet 을 사용하지 못함
					: ip 가 필요하기 때문에 인터넷 같은게 안되면(=통신이 안되면) 사용이 불가능
			: Telnet 을 가상 터미널 Virtual Terminal 이라고도 함

		
	: 라우터의 모드 :
		프롬프트( 대기상태 ) 종류
			1. Router >  
				: 사용자 모드
				: 가장 낮음
			2. Router # 
				: 관리자모드
			3. Router (config)#
				: # 설정모드
				: 가장 높음

		명령어
			enable
				: > 에서 # 으로 
			config term
				: # 에서 (config)# 으로
			exit	
				: 한단계 상위 단계로 넘어감 ( > --> # --> config# )

			ctrl + z 
				: 현재 무슨 단계였건 # 으로 됨

		종류
			(1) ROMMON Mode
				: 라우터의 패스워드를 모르거나, ios 이미지 파일에 이상이 생긴 경우 복구를 하기 위한 모드	
					: 평소에 사용 잘 안함
				: ROMMON == ROM MONitor
				: 부팅 시 Ctrl + break 혹은 Register 값을 변경해서 들어갈 수 있음

			(2) Setup Mode
				: NVRAM 에 저장된 Router 설정 파일이 없는 경우 자동으로 실행되는 모드
					: 일반적으론 잘 사용 안함
					: 질의 응답 방식으로 일일이 다 설정해야되서 개불편

			(3) User mode 사용자 모드
				: Router에 Console 혹은 Telnet으로 접속하면 처음 보이는 화면
				: 프롬프트는 'Router > '
				: 권한이 낮은 단계의 모드이기 때문에, 명령어가 제한된 편. 

			(4) Privileged Mode 운영자 모드. 관리자 모드/
				: 방법
					1. User mode 에서 enalbe 명령어를 사용하면 보임
					2.  어떤 모드에 있건 ctrl + z 
				: 프롬프트는 'Router # '
				: 권한이 중간 단계이긴 하지만 , 여전히 명령어가 제한됨.
				: 다시 User mode로 나오고 싶을 경우 ‘disable’ 명령어를 사용.


			(5) Global configuration Mode (설정 모드)
				: Privileged mode에서 ‘configure terminal’ 명령어를 입력하면 들어올 수 있다.
				: 권한이 가장 높아 모든 명령어 사용 가능
				: 다시 privileged Mode 로 가고 싶으면 
					1. exit
					2. end
					3. ctrl+z


실습

	2621XM 라우터 2개
		: 모듈형 라우터
		: 설정 >> wic2t 모듈을 라우터에 연결 (전원끈 상태에서)

	라웉터끼리 
		: serial DCE 로 Ethernet 0/0 으로 이음

	노트북 꺼내고
		: console 케이블 로 노트북 클릭 후 rs232 인가 뭔가 클릭 한 후 라우터에 연결한 후 console 클릭

	컴터와 스위치, 라우터를 striaght thorugh 케이블로 연결
		: 아마도 fast ethernet 으로

	컴퓨터의 ip , gate way 설정
		: 각각 ip 는 192.168.10.1 , 192.168.10.2 로하고 gate way 는 모두 192.168.10.254
			: P 주소 192.168.10.254은 대부분의 무선 라우터의 기본 게이트웨이
	여러개랑 연결되있는 "라우터" 누르고 - CLI 창 연다.  해당 라우터의 설정이 다 끝나면 console cable 을 나머지 라우터에 연결하고 그 라우터를 클릭하여 cli 창에서 또 설정한다
		:CLI >> command interface 

ctrl c ctrl v 가 안되는 이유 >> 클립보드를 사용하지 않아서

Router> 
	: 사용자모드(프롬프트 기억할 것)
	: 설정 내역을 보지도 못한다.

Router>  ? 
	:명령어 도움말. 참고로 물음표는  shift + ? 함 입력됨.
Router> di ? 
	: 명령어의 일부 작성 후 일부가 포함된 명령어 목록 툴력 . 
Router> enable 
	:관리자 모드 진입 명령어 (==en)
Router> en 
	:관리자 모드 진입 명령어 (==enalbe). 그러니까 명령어의 일부만 작성해도 됨
Router# 
	: 관리자 모드 프롬프트
	: 설정을 변경할 순 없지만 설정 내용을 볼  수 있다
Router# disable 
	: 관리자 모드에서 다시 사용자 모드로 전환

Router#lee
Translating "lee"...domain server (255.255.255.255)
	: 관리자 모드에서 존재하지 않는 명령어인 경우 도메인의 이름으로 간주 DNS servver 를 찾게 된다. 그래서 시간이 지연된다.


Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.

	: 관리자 모드에서 설정 모드로 진입
	: conf t 로 도 가능

ctrl + z
	: 설정모드에서 관리자 모드로 돌아가기

tab 키  
	: 자동 완성 기능

Router(config)#hostname 라우터이름
Seoul_Router(config)#
	: 라우터 이름 변경
	:" ho 라웉터이름"  로도 가능


R1(config)#no ip domain-lookup
	:  관리자 모드에서 ㅁ명령어 오류로 DNS server 찾기를 해제 시키기게 하는 설정 명령어
		: 그러니까 아래 처럼 DNS server 찾기 가 안되게 한단 말이다
			Router#lee
			Translating "lee"...domain server (255.255.255.255)


R1(config)#enable password itbank1004
	: "사용자 모드"에서 "관리자 모드"로 넘어갈때의 암호 설정	
	:보안성이 별로므로 비추천
		: 그러니까 관리자 ㅁ모드에서 show running-config 했을때 password 부분이 그대로 보인다는 거임


R1#show running-config
Building configuration...

Current configuration : 666 bytes
!
version 12.2
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname R1
!
!
!
enable secret 5 $1$mERr$gQReHhHvFqlgnsqk6twQv1
enable password itbank1004
!
!
!
!
!
!
no ip cef
no ipv6 cef

	: 현제 작업중인 설정 내용을 출력함
	: running-config 니까 RAM 에 저장되있는거 출력하는거임
	: ctrl + c 로 빠져나오기 가능




R1(config)#enable secret kgitbank1004
	: 사용자 모드 패스워드 설정, 암호화 되어 저장됨
	: 보안성이 우수하므로 추천
		: 그러니까 관리자 ㅁ모드에서 show running-config 했을때 password 부분이 암호화 되어 보인다ㅡㄴ거임ㅁ

	: enable password , enable secret 이 모두 적용되었을 경우 enable secret 이 우선시 된다.


R1(config)#line console 0
	: 콘솔 모드 진입 명령어 
	: 인터페이스 프롬프트는 구분되지 않는다.
	: 뒤에 숫자는 포트 번호인데 콘슬은 포트가 하나밖에 없어서 무조건 0 이다

R1(config-line)#password kgitbank1004
	: 콘솔 접속 패스워드 설정
	: 암호화 저장은 따로 없음
	: 참고로 원래는 관리자모드로 진입할때 설정한 패스워드와ㅣ 다르게 설정을 해야되는데 학생들이 너무 지능이 딸려서 통일함


R1(config-line)#login
	: 라인 형성( 위의 패스워드를 적용함)
	
R1(config-line)#logging synchronous
	: 로그와 명령어 분리
		: 그러니까 라우터 작동에 의한 출력으로 인하여 줄 밀림 현상 방지
			: 그러니까 어떤 명령어를 치면 뭔가 결과물이 출력되는게 있는데 , 이게 다음 명령어 치고 있는데 이 사이에 출력되는 경우가 있기 때문ㄴ에 애쵸에 ㅈ방지해주는 것

R1(config-line)#exec-timeout 0 0 
	: 일정 시간 동안 작동 안하면 자동 로그아웃 설정
	: 앞 숫자는 분. 뒷 숫자는 초
	: 0 0 으로 설정하면 무한대 사용으로 설정됨
		
R1(config-line)#exit
R1(config)#
	: 한단계 상위모드 재진입 명령어

R1(config)#line vty 0 4
R1(config-line)#
	: telent 모드 진입 명령어(기본적으로 5개 회선 단위로 세팅)
		:그러니까 5 명이 동시에 접속 가능
		: 0 4 는 0<= <=4 라는 뜻
		: 5 9 같은 것도 가능
	: vty == virtual termianl 

R1(config-line)#pass kgitbank1004
	: (telnet 으로) 원격 접속 퍃스워드 설정



R1(config)#username user1 pass kgitbank1004
	: 계정과 ㅍ패스워드 동시 설
	: 원격 접속은 최소한 패스워드 또는 계정 설정이 됭어ㅣㅆ어야함

R1(config-line)#login
	: 라인 형성
	: 근냥 라인 형성만 할경우

R1(config)#line vty 0 4
R1(config-line)#login local
	: 계정으로 하려면 위처럼 같이 따로 해야됨


R1(config-line)#^Z
	: 어느 모드에서든 바로 관리자 모드(== '#')로 진입합

R1#copy running-config startup-config
	: 설정 내용 저장 
		:이거 안하면 전원끄면 다 날라감
	: running-config >> ram 에 올라와 있는거
	: startup-config >> nvram 에 저장되있는거
	: copy r s 랑 같은 뜻
	: 이거 관리자 모드에사 해줘야됨


: 일정한 루틴을 세워서 작업해라. ㅈ중구 난방으로 하지 말고

R1(config)#interface fastEthernet0/0
	: 패스트 이더넷 인터페이스 진입 명령어
	: int f0/0 도 가능

R1(config)#interface fastEthernet0/0
R1(config-if)#ip address 192.168.10.254 255.255.255.0
	: https://shine94.tistory.com/221
	: ip 설정
	: 두번째  ip 로 오는건 서브넷 마스크인듯
		: 네트워크 ID 부분 구하게 해주는 역할
	: ip 의 변경하는 경우 경우 삭제하고 다시 설정하는게 아니라 다시 쓰면 자동으로 변ㄹ경됨

R1(config-if)#int fa0/0
R1(config-if)#no ip address
	: 설정되어있는 ip 세팅을 아예 제거

R1(config-if)#no shutdown
	: 인터페이스 활성화
		: 기본은 비활성화 상태
	: 이거 하면 라우터의 lan과 연결된 부분에 초록불 들어온다
	: no sh 랑 같은 의미

R1(config)#int serial0/0
	: wan 과 연결하는 거를 설정
R1(config-if)#ip address 10.10.10.1 255.255.255.0
	: address 를 add 로 줄여서 해도 되긴 함
R1(config-if)#no sh



